* #上海疫情
* 2022 上海疫情数据

#+NAME: total
| 分类 |   累计 |  确诊 | 无症状 | 死亡 | 感染/% |   截止日期 |
|------+--------+-------+--------+------+--------+------------|
| 总计 | 625852 | 55599 | 570253 |  536 |   2.52 | 05-08 0 点 |
| 5 月 |  35093 |  2235 |  32858 |  114 |        | 05-08 0 点 |
| 4 月 | 554111 | 51819 | 502292 |  422 |        |      04-30 |
| 3 月 |  36641 |  1545 |  35096 |      |        |      03-31 |
| 2 月 |      7 |     0 |      7 |      |        |      02-28 |
#+Tblfm: @3$3=remote(d5, @2$8) + remote(d5, @2$7) + remote(d5, @2$6) + remote(d5, @2$5) + remote(d5, @2$4) + remote(d5, @2$3) + remote(d5, @2$2)
#+TBLFM: @3$4=remote(d5, @3$8) + remote(d5, @3$7) + remote(d5, @3$6) + remote(d5, @3$5) + remote(d5, @3$4) + remote(d5, @3$3) + remote(d5, @3$2)
#+TBLFM: @3$5=remote(d5, @4$8) + remote(d5, @4$7) + remote(d5, @4$6) + remote(d5, @4$5) + remote(d5, @4$4) + remote(d5, @4$3) + remote(d5, @4$2)
#+TBLFM: @3$2=@3$3+@3$4
#+TBLFM: @2$2..@2$5=vsum(@3..@>);f2
#+TBLFM: @2$6=@2$2*100/24870895;f2
#+TBLFM: @2$7='(concat (format-time-string "%m-%d") " 0 点");N
#+TBLFM: @3$7='(concat (format-time-string "%m-%d") " 0 点");N

#+NAME: death
| 分类 | 死亡 | 均龄 | 最大 | 最小 | 死亡/% | 截止日期   |
|------+------+------+------+------+--------+------------|
| 总计 |  536 | 82.9 |  101 |   33 |   0.09 | 05-08 0 点 |
| 5 月 |  114 |      |      |      |        | 05-08 0 点 |
| 4 月 |  422 |      |      |      |        | 04-30      |
#+TBLFM: @2$2=remote(siwang, @2$5)
#+TBLFM: @2$3=remote(siwang, @2$6)
#+TBLFM: @2$4=remote(siwang, @2$7)
#+TBLFM: @2$5=remote(siwang, @2$8)
#+TBLFM: @3$2=remote(total, @3$5)
#+TBLFM: @2$6=@2$2*100/remote(total, @2$2);f2
#+TBLFM: @2$7='(concat (format-time-string "%m-%d") " 0 点");N
#+TBLFM: @3$7='(concat (format-time-string "%m-%d") " 0 点");N

#+NAME: d5
| 5 月   |     1 |     2 |     3 |     4 |     5 |     6 |     7 |     8 |     9 |    10 |
|--------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|
| 确诊   |   727 |   274 |   260 |   261 |   245 |   253 |   215 |       |       |       |
| 无症状 |  6606 |  5395 |  4722 |  4390 |  4024 |  3961 |  3760 |       |       |       |
| 死亡   |    32 |    20 |    16 |    13 |    12 |    13 |     8 |       |       |       |
| 5 月   |    11 |    12 |    13 |    14 |    15 |    16 |    17 |    18 |    19 |    20 |
|--------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|
| 确诊   |       |       |       |       |       |       |       |       |       |       |
| 无症状 |       |       |       |       |       |       |       |       |       |       |
| 死亡   |       |       |       |       |       |       |       |       |       |       |
| 5 月   |    21 |    22 |    23 |    24 |    25 |    26 |    27 |    28 |    29 |    30 |
|--------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|
| 确诊   |       |       |       |       |       |       |       |       |       |       |
| 无症状 |       |       |       |       |       |       |       |       |       |       |
| 死亡   |       |       |       |       |       |       |       |       |       |       |

#+NAME: d4
| 4 月   |     1 |     2 |     3 |     4 |     5 |     6 |     7 |     8 |     9 |    10 |
|--------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|
| 确诊   |   260 |   438 |   425 |   268 |   311 |   322 |   824 |  1015 |  1006 |   914 |
| 无症状 |  6051 |  7788 |  8541 | 13086 | 16766 | 19660 | 20398 | 22609 | 23979 | 25173 |
| 4 月   |    11 |    12 |    13 |    14 |    15 |    16 |    17 |    18 |    19 |    20 |
|--------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|
| 确诊   |   994 |  1189 |  2573 |  3200 |  3590 |  3238 |  2417 |  3084 |  2494 |  2634 |
| 无症状 | 22348 | 25141 | 25146 | 19872 | 19923 | 21582 | 19831 | 17332 | 16407 | 15861 |
| 死亡   |       |       |       |       |       |       |     3 |     7 |     7 |     8 |
| 4 月   |    21 |    22 |    23 |    24 |    25 |    26 |    27 |    28 |    29 |    30 |
|--------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|
| 确诊   |  1931 |  2736 |  1401 |  2472 |  1661 |  1606 |  1292 |  5487 |  1249 |   788 |
| 无症状 | 15698 | 20634 | 19657 | 16983 | 15120 | 11956 |  9140 |  9594 |  8932 |  7084 |
| 死亡   |    11 |    12 |    39 |    51 |    52 |    48 |    47 |    52 |    47 |    38 |

#+NAME: d3
| 3 月   |   1 |   2 |   3 |    4 |    5 |    6 |    7 |    8 |    9 |   10 |      |
|--------+-----+-----+-----+------+------+------+------+------+------+------+------|
| 确诊   |   1 |   3 |   2 |    3 |    0 |    3 |    4 |    3 |    4 |   11 |      |
| 无症状 |   1 |   5 |  14 |   16 |   28 |   45 |   51 |   62 |   76 |   64 |      |
| 3 月   |  11 |  12 |  13 |   14 |   15 |   16 |   17 |   18 |   19 |   20 |      |
|--------+-----+-----+-----+------+------+------+------+------+------+------+------|
| 确诊   |   5 |   1 |  41 |    9 |    5 |    8 |   57 |    8 |   17 |   24 |      |
| 无症状 |  78 |  64 | 128 |  130 |  197 |  150 |  203 |  366 |  492 |  734 |      |
| 3 月   |  21 |  22 |  23 |   24 |   25 |   26 |   27 |   28 |   29 |   30 |   31 |
|--------+-----+-----+-----+------+------+------+------+------+------+------+------|
| 确诊   |  31 |   4 |   4 |   29 |   38 |   45 |   50 |   96 |  326 |  355 |  358 |
| 无症状 | 865 | 977 | 979 | 1580 | 2231 | 2631 | 3450 | 4381 | 5656 | 5298 | 4144 |

#+NAME: d2
| 2 月   | 21 | 22 | 23 | 24 | 25 | 26 | 27 | 28 |
|--------+----+----+----+----+----+----+----+----|
| 确诊   |    |    |  0 |  0 |  0 |  0 |  0 |  0 |
| 无症状 |    |    |  0 |  1 |  1 |  1 |  1 |  3 |

* 2022 上海疫情死亡数据

#+NAME: siwang

|  日期 |  新增 | 确诊 | 无症状 | 死亡 |  均龄 | 最大 | 最小 |
|-------+-------+------+--------+------+-------+------+------|
|  汇总 |       |      |        |  536 | 82.90 |  101 |   33 |
| 05-07 |  3975 |  215 |   3760 |    8 | 80.60 |   93 |   55 |
| 05-06 |  4214 |  253 |   3961 |   13 | 83.80 |   95 |   62 |
| 05-05 |  4269 |  245 |   4024 |   12 | 84.08 |   95 |   59 |
| 05-04 |  4651 |  261 |   4390 |   13 | 82.77 |  100 |   40 |
| 05-03 |  4982 |  260 |   4722 |   16 | 82.90 |   99 |   64 |
| 05-02 |  5669 |  274 |   5395 |   20 | 83.95 |  101 |   49 |
| 05-01 |  7333 |  727 |   6606 |   32 | 84.10 |   98 |   53 |
| 04-30 |  7872 |  788 |   7084 |   38 | 80.90 |   97 |   50 |
| 04-29 | 10181 | 1249 |   8932 |   47 | 82.40 |  101 |   55 |
| 04-28 | 15081 | 5487 |   9594 |   52 | 84.02 |   99 |   58 |
| 04-27 | 10432 | 1292 |   9140 |   47 | 84.70 |  101 |   67 |
| 04-26 | 13562 | 1606 |  11956 |   48 | 80.85 |   99 |      |
| 04-25 | 16781 | 1661 |  15120 |   52 | 83.10 |  100 |   33 |
| 04-24 | 19455 | 2472 |  16983 |   51 | 84.20 |  100 |      |
| 04-23 | 21058 | 1401 |  19657 |   39 | 78.70 |   97 |      |
| 04-22 | 23370 | 2736 |  20634 |   12 | 88.20 |   99 |      |
| 04-21 | 17629 | 1931 |  15698 |   11 | 84.20 |   94 |      |
| 04-20 | 18495 | 2634 |  15861 |    8 | 77.50 |   93 |      |
| 04-19 |       | 2494 |  16407 |    7 | 84.20 |      |      |
| 04-18 |       | 3084 |  17332 |    7 |       |  101 |      |
| 04-17 |       | 2417 |  19831 |    3 |       |   91 |      |
#+TBLFM: @2$6=vsum(@3..@21)/19;f2
#+TBLFM: @2$5=vsum(@3..@>);f2
#+TBLFM: @2$7=vmax(@3..@>);f2
#+TBLFM: @2$8=vmin(@3..@>);f2
#+TBLFM: @3$2=vsum(@3$3, @3$4);f2
